#+title:  Answer Set Programming
*** #+NAME: for testing ob-clingo
#+HEADER: :clingo-args -n 4
#+begin_src clingo :results output
1{a(1..5)}2.

#+end_src

#+RESULTS:
#+begin_example
   clingo version 5.4.0
   Reading from ...45c0000gn/T/babel-7DJl0a/clingo-GBqwQn
   Solving...
   Answer: 1
   a(5)
   Answer: 2
   a(3)
   Answer: 3
   a(3) a(5)
   Answer: 4
   a(4)
   SATISFIABLE

   Models       : 4+
   Calls        : 1
   Time         : 0.002s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
   CPU Time     : 0.002s
#+end_example

**** #+NAME: Fact Examples
#+begin_src clingo :results output
%%Simple values:
a. b. c.
%%Compound:
a(1).
something(else).
%%Ranges:
a(1..3).
#+end_src

#+RESULTS:
#+begin_example
clingo version 5.4.0
Reading from ...45c0000gn/T/babel-7DJl0a/clingo-qlIbBl
Solving...
Answer: 1
a(1) a(2) a(3) a b c something(else)
SATISFIABLE

Models       : 1
Calls        : 1
Time         : 0.001s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.001s
#+end_example

**** #+NAME: Negation Examples
#+begin_src clingo :results output
a.

%% Default Negation (closed world):
c :- not b.

%% Classical Negation (open world):
d :- -b.

#+end_src

#+RESULTS:
#+begin_example
    clingo version 5.4.0
    Reading from ...45c0000gn/T/babel-7DJl0a/clingo-w0V4De
    Solving...
    Answer: 1
    c a
    SATISFIABLE

    Models       : 1
    Calls        : 1
    Time         : 0.001s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
    CPU Time     : 0.001s
#+end_example

**** #+NAME: Disjunction Test
#+begin_src clingo :results output :clingo-models 5 :c-W all :clingo-output-debug all
{ a(1..4) }.
c :- 1{ a(1;2) }.
:- not c.
#+end_src

#+RESULTS:
#+begin_example
clingo version 5.4.0
Reading from ...45c0000gn/T/babel-7DJl0a/clingo-skiRnE
Solving...
Answer: 1
a(2) c
Answer: 2
a(2) a(4) c
Answer: 3
a(2) a(3) c
Answer: 4
a(2) a(3) a(4) c
Answer: 5
a(1) c
SATISFIABLE

Models       : 5+
Calls        : 1
Time         : 0.003s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.003s
#+end_example

**** #+NAME: Max Aggregate Example
#+begin_src clingo :results output :clingo-models 5 :c-W all :clingo-output-debug all
3{ test(1..6) }.
the_max(X) :- X = #max { Y : test(Y) }.
#+end_src

#+RESULTS:
#+begin_example
clingo version 5.4.0
Reading from ...45c0000gn/T/babel-7DJl0a/clingo-YfPBWx
Solving...
Answer: 1
test(1) test(2) test(3) the_max(3)
Answer: 2
test(1) test(2) test(4) the_max(4)
Answer: 3
test(1) test(3) test(4) the_max(4)
Answer: 4
test(2) test(3) test(4) the_max(4)
Answer: 5
test(1) test(2) test(3) test(4) the_max(4)
SATISFIABLE

Models       : 5+
Calls        : 1
Time         : 0.014s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.014s
#+end_example

*** Pooling
#+NAME: Pooling Examples
#+begin_src clingo :results output :clingo-models 5 :c-W all :clingo-output-debug all
test(a,b,c;d,e,f).

grid((1;2;3),(4;5;6)).
alt_grid(X,Y) :- X=(1;2;3), Y=(1;2;3).
#+end_src

#+RESULTS: Pooling Examples
#+begin_example
clingo version 5.4.0
Reading from ...45c0000gn/T/babel-7DJl0a/clingo-3izJKQ
Solving...
Answer: 1
alt_grid(3,3) alt_grid(2,3) alt_grid(1,3) alt_grid(3,2) alt_grid(2,2) alt_grid(1,2) alt_grid(3,1) alt_grid(2,1) alt_grid(1,1) test(a,b,c) test(d,e,f) grid(1,4) grid(2,4) grid(3,4) grid(1,5) grid(2,5) grid(3,5) grid(1,6) grid(2,6) grid(3,6)
SATISFIABLE

Models       : 1
Calls        : 1
Time         : 0.007s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.007s
#+end_example

*** Condition literals / Set notation
#+NAME: Condition literal example
#+begin_src clingo :results output :clingo-models 5 :c-W all :clingo-output-debug all
person(jane;john).
available(X) :- person(X).
meet :- available(X) : person(X).
% Expands to:
%meet :- available(jane), available(john).

rule_side(X, Y) : person(X) :- Y=2.

#+end_src

#+RESULTS: Condition literal example
#+begin_example
clingo version 5.4.0
Reading from ...45c0000gn/T/babel-7DJl0a/clingo-YChP2Y
Solving...
Answer: 1
person(jane) person(john) available(jane) available(john) meet rule_side(john,2)
Answer: 2
person(jane) person(john) available(jane) available(john) meet rule_side(jane,2)
SATISFIABLE

Models       : 2
Calls        : 1
Time         : 0.004s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.004s
#+end_example

**** #+NAME: Const Example
#+begin_src clingo :results output :clingo-models 5 :c-W all :clingo-output-debug all
#const value = 5.
a(value).
#+end_src

#+RESULTS:
#+begin_example
    clingo version 5.4.0
    Reading from ...45c0000gn/T/babel-7DJl0a/clingo-vjJ1iL
    Solving...
    Answer: 1
    a(5)
    SATISFIABLE

    Models       : 1
    Calls        : 1
    Time         : 0.001s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
    CPU Time     : 0.001s
#+end_example

***   #+NAME: Rain and Sprinklers
#+begin_src clingo :results output :clingo-models 5 :c-W all :clingo-output-debug all
0 { rain;sprinkler;summer } 1.
%:- rain, sprinkler,summer.
wet(rain) :- rain.
wet(sprinkler) :- sprinkler.
dry :- not wet(_).
-dry :- wet(_).
%%:- not wet(_).
#+end_src

#+RESULTS:
: Syntax Error

***   #+NAME: another test
   #+begin_src clingo :results output :clingo-models 5 :c-W all :clindo-output-debug all
time(1..5).
fruit(3).

available(X) :- fruit(X).

eat(1, X) :- time(1), fruit(X).

{eat(T, X)} :- time(T), eat(T-1, X+1).
{buy(T, X+1)} :- time(T), eat(T-1, X).
{wait(T, 0)}   :- time(T), eat(T-1, 0).


used(T) :- eat(T,_).
used(T) :- buy(T,_).
used(T) :- wait(T).


:- eat(T,_), T>5.
:- eat(_, X), X<0.
:- eat(5,_); wait(5).
:- eat(T, _), buy(T, _).
:- time(T), not used(T).

#show eat/2.
#show wait/2.
#show buy/2.
#+end_src

#+RESULTS:
#+begin_example
clingo version 5.4.0
Reading from ...45c0000gn/T/babel-7DJl0a/clingo-OZxjKu
Solving...
Answer: 1
eat(1,3) eat(2,2) eat(3,1) eat(4,0) buy(5,1)
Answer: 2
eat(1,3) eat(2,2) eat(3,1) eat(4,0) buy(5,1) wait(5,0)
SATISFIABLE

Models       : 2
Calls        : 1
Time         : 0.003s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.003s
#+end_example

*** transitions
#+NAME: transition test
#+begin_src clingo :results output :clingo-models 5 :c-W all :clingo-output-debug all
{test(X,Y); test(Y,X)} :- X=a, Y=b.

#+end_src

#+RESULTS: transition test
#+begin_example
clingo version 5.4.0
Reading from ...45c0000gn/T/babel-7DJl0a/clingo-FbTo7f
Solving...
Answer: 1
a
Answer: 2
test(b,a) a
Answer: 3
test(a,b) a
Answer: 4
test(a,b) test(b,a) a
Answer: 5
c
SATISFIABLE

Models       : 5+
Calls        : 1
Time         : 0.748s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.004s
#+end_example

** Simple
#+NAME: Simple
#+begin_src clingo :results output :clingo-models 5 :c-W all :clingo-output-debug all
a(1..5).
#+end_src

#+RESULTS: Simple
#+begin_example
clingo version 5.5.2
Reading from ...45c0000gn/T/babel-lEnfjf/clingo-sLtqHw
Solving...
Answer: 1
a(1) a(2) a(3) a(4) a(5)
SATISFIABLE

Models       : 1
Calls        : 1
Time         : 0.002s (Solving: 0.00s 1st Model: 0.00s Unsat: 0.00s)
CPU Time     : 0.002s
#+end_example

